---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInMainModelWarn
source: html/9ff73cfa-01f2-0fc0-c830-930b0eac5637.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInMainModelWarn Property

An insert in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingHostByElementsInMainModelWarn { get; }
```